package core; //класс находится внутри пакета core

public class Car //Создаем класс машину
{
    public String number; //общедоступная строковая переменная, номер машины
    public int height; //высота машины, целое число 4 байта
    public double weight; //вес машины, число с запятой 8 байт
    public boolean hasVehicle; //логическая переменная, если это прицеп (true/false)
    public boolean isSpecial; //если это спецтранспорт, булевая переменная

    public String toString() //определяем метод преобразования объекта в строку
    {
        String special = isSpecial ? "СПЕЦТРАНСПОРТ " : ""; //строковая переменная спецтранспорт. С помощью тернарного оператора определяем, либо переменная будет равна "", либо "СПЕЦТРАНСПОРТ "
        return "\n=========================================\n" + //возвращаем текстовое представление объекта
            special + "Автомобиль с номером " + number +
            ":\n\tВысота: " + height + " мм\n\tМасса: " + weight + " кг";
    }
}